package com.tak.study;

import java.util.Random;

public class Study {

    public static void main(String[] args) {
        //단어 두개를 출력하기
        /*컴퓨터에서 단어들을 찾아 여기에 넣은 후 2개를 "동시에" 출력하기*/
        String[] words = {
                          "돼지"
                        , "사진"
                        , "종이"
                        , "키보드"
                        , "연필"
                        , "책상"
                        , "마우스"
                        , "증명사진"
                        , "에어컨"
                        , "이어폰"             //10개
                        , "아이스 아메리카노"
                        , "마스크"
                        , "카페"
                        , "아이폰"
                        , "갤럭시"
                        , "벤츠"
                        , "전기"
                        , "코딩"
                        , "벽돌"
                        , "식물"              //20개
                        , "김치"
                        , "돼지고기"
                        , "소고기"
                        , "자동차"
                        , "21세기"
                        , "복싱"
                        , "복싱화"
                        , "바다"
                        , "블랙팬서"
                        , "전등"              //30개
                        , "복싱"
                        , "글러브"
                        , "복싱화"
                        , "모나미"
                        , "무지개"
                        , "경매"
                        , "인생"
                        , "공자"
                        , "논어"
                        , "영풍문고"          //40개
                        , "첫 눈"
                        , "백반"
                        , "싸움"
                        , "주먹"
                        , "러닝화"
                        , "가수"
                        , "가방"
                        , "딸기"
                        , "눈물"
                        , "행복"             //50개
                        , "데시벨"
                        , "성수동"
                        , "영화"
                        , "넷플릭스"
                        , "모니터"
                        , "책"
                        , "눈썹"
                        , "문신"
                        , "목걸이"
                        , "대저택"           //60개
                        , "모자"
                        , "아름다움"
                        , "안경"
                        , "왁스"
                        , "눈덩이"
                        , "체스"
                        , "로또"
                        , "꿈"
                        , "포마드"
                        , "천국"            //70개
                        , "치맥"
                        , "연어롤"
                        , "드릴"
                        , "순수"
                        , "나이키"
                        , "연애"
                        , "장막"
                        , "지름길"
                        , "독서"
                        , "편지"            //80개
                        , "퇴근"
                        , "출근"
                        , "제자리"
                        , "의자"
                        , "책갈피"
                        , "월드컵"
                        , "호탕"
                        , "탕후루"
                        , "수능"
                        , "겨울"            //90개
                        , "장어"
                        , "첫눈"
                        , "고급"
                        , "콩"
                        , "용산"
                        , "파주"
                        , "서울"
                        , "한국"
                        , "종이의집"
                        , "탕수육"            //100개
                        , "맥도날드"
                        , "배달"
                        , "인천"
                        , "급행"
                        , "노량진"
                        , "계단"
                        , "코트"
                        , "폭설"
                        , "강추위"
                        , "목도리"            //110개
                        , "괴물"
                        , "제주도"
                        , "청바지"
                        , "아바타"
                        , "알바"
                        , "주말"
                        , "인텔리제이"
                        , "자바"
                        , "목적"
                        , "목표"              //120개
                        , "목소리"
                        , "연금술"
                        , "황금"
                        , "파도"
                        , "천리길"
                        , "상속"
                        , "비법"
                        , "비빔면"
                        , "유니클로"
                        , "철학"              //130개
                        , "블루종"
                        , "빵"
                        , "불로 소득"
                        , "근로 소득"
                        , "주식"
                        , "사업"
                        , "비트코인"
                        , "송곳니"
                        , "트리마제"
                        , "부자"              //140개
                        , "벼락"
                        , "진리"
                        , "불교"
                        , "불고기"
                        , "스프링"
                        , "자바스크립트"
                        , "언어"
                        , "영어"
                        , "붕어빵"
                        , "슈크림"             //150개
                        };


        for (int i = 0; i < 2; i++) {

            int ranNum = (int)((Math.random()*10000) % 150);      //랜덤한 수를 생성

            System.out.println(words[ranNum]);                 //랜덤의 난수를 넣어서 출력

        }

    }

}
